skillfair/app/controllers/products_controller.rb

DELETE FROM "products" WHERE "products"."id" = 1
---
  def destroy
    @product.destroy!

SELECT "products".* FROM "products" WHERE "products"."id" = 1 LIMIT 1
---
    def set_product
      @product = Product.find(params.expect(:id))